using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;


public class TextControler : MonoBehaviour
{
    public Text nameText;
    public Text infoText;
    public Text _ganr;


    public Image img;
    public Sprite[] imgs;

    public Text[] _names;
    public Text[] _infos;


    string[] names = new string[20];
    string[] info = new string[20];
    string[] ganr = new string[20];
    private void Start()
    {
        names[0] = "Людина-павук: Немає шляху додому";
        info[0] = "Після перемоги над Містеріо особистість Пітера Паркера розкривається світу, ставлячи під загрозу його життя та місію Людини-павука. У пошуках нового наставника він звертається за допомогою до майстра містичних мистецтв, доктору Стівену Стренджу, який має в своєму арсеналі спеціальне заклинання для цієї справи. Через смертельну аварію ритуал йде не за планом, в результаті чого на Землю проникають прогалини в мультивсесвіті, через які на Землю проникають вороги Людини-павука з альтернативних світів, включаючи Зеленого Гобліна і божевільного вченого Отто Октавія.";

        names[1] = "Найкраща гармата: Маверік";
        info[1] = "Залишаючись вірним небу і надзвуковим швидкостям, льотчик-випробувач капітан Піт Мітчелл на прізвисько «Маверік», що володіє надзвичайно великим бойовим досвідом, вже кілька десятиліть відмовляється від підвищення або відставки. Одного разу старий друг і колишній морський авіатор Том Казанський, який став командувачем Тихоокеанським флотом США, просить Мітчелла бути наставником для загону випускників Top Gun, яким належить виконати спеціальну місію. Одним з молодих підлеглих Маверіка є лейтенант Бредлі Бредшоу, син його покійного найкращого друга.";

        names[2] = "Швидше, ніж куля";
        info[2] = "На чолі історії стоїть професійний вбивця на прізвисько «Сонечко», який від імені свого куратора погоджується на нове завдання в Японії. Він сідає в інноваційний поїзд-куля, що прямує з Токіо в Моріоку, щоб вистежити і вкрасти таємничу валізу, але стикається з непередбаченими труднощами. Як незабаром з'ясовується, крім нього, є ще кілька холоднокровних вбивць зі схожою метою, що перетворює поїздку на поїзді в крайню безперервну різанину.";

        names[3] = "Людина-мураха і оса: квантова манія";
        info[3] = "Супергерої Скотт Ленг і Хоуп Ван Дейн повертаються, щоб продовжити свої пригоди в ролі Людини-мурахи і Оси. Разом з батьками Хоупа Хенком Пімом і Джанет Ван Дейн сім'я досліджує Квантовий світ, взаємодіє з дивними новими істотами і пускається в пригоду, яка виведе їх за межі можливого.";

        names[4] = "Видобуток / Хижак 5: Видобуток";
        info[4] = "На початку XVIII століття дівчина на ім'я Нару з племені команч, що живе на Північних Великих рівнинах, яка не бажає займатися жіночим ремеслом, прагне пройти ритуал ініціації, щоб стати повноцінним воїном, як її старший брат Таабе. Вирушаючи в небезпечну і непередбачувану подорож, вона повинна перемогти дикого звіра, щоб довести свою силу і безстрашність своїм одноплемінникам. Всупереч очікуванням, молодій жінці доводиться стикатися віч-на-віч з небезпечним інопланетним хижаком, що призводить до напруженої бійки на смерть.";

        names[5] = "Енола Холмс";
        info[5] = "Дія розгорнеться в 1884 році у Великобританії. Прямо в день свого шістнадцятого дня народження Енола Холмс дізнається, що її мати зникла безвісти. Жінка залишила після себе таємничий набір подарунків, але поняття не має, куди вона могла піти. Норовлива і волелюбна дівчина залишилася під опікою своїх братів Шерлока і Майкрофта, які вирішують відправити її в інтернат. Аби не допустити жити в полоні, Енола тікає в Лондон в пошуках матері, але стикається з таємницею, яка загрожує самому існуванню Британської імперії ...";

        names[6] = "Вбивство на Східному експресі";
        info[6] = "Захоплюючий фільм знятий за мотивами популярного роману британської письменниці Агати Крісті.\r\nДія відбувається взимку. Відомому бельгійському детективу Еркюлю Пуаро, який знаходиться в Стамбулі, необхідно якомога швидше дістатися до Великобританії. Ось тільки вільних місць в найближчому знаменитому \"Східному експресі\" немає, але нашому герою все ж вдається сісти в поїзд. Пуаро зазначає, що тривала поїздка змусила дуже колоритну компанію зібратися в одному місці: в одній машині було більше десятка людей різних національностей, поглядів і соціального статусу. Поспілкувавшись із багатим американцем, який запропонував детективу на деякий час стати його охоронцем, Пуаро ліг спати.\r\nВночі поїзд був змушений зробити зупинку через несприятливі погодні умови. А вранці наш герой дізнається, що вночі було скоєно жорстоке вбивство, і тепер кожен з пасажирів потрапляє під підозру.";

        names[7] = "За пивом!";
        info[7] = "Це 1967 рік. Американське суспільство засмучує кровопролитна війна у В'єтнамі, але тільки не Чікі Донохью, який вважає за краще дотримуватися рутинних церемоній - зустрічей з друзями і галасливих вечірок в барі, і він абсолютно не підозрює про серйозність ситуації в зоні бойових дій. Одного разу, випиваючи в улюбленому барі, Чікі придумує смертельний план: він має намір сісти на наступний корабель і дістатися в іншу частину планети, щоб доставити пиво своїм кращим друзям, які б'ються на полі бою. Озброївшись наполегливістю, наївністю і везінням, головний герой прибуває до В'єтнаму, ще не припускаючи, що йому доведеться пережити жахи військових дій.";

        names[8] = "Енола Холмс 2";
        info[8] = "Головна героїня відкриває власне детективне агентство, але стикається з очевидними проблемами - ніхто особливо не поспішає довіряти дівчині, але все змінює візит в агентство дівчини, сестра якої зникла. За справу тут же береться Енола, до якого приєднується її старший брат Шерлок.";

        names[9] = "Тор: Любов і грім";
        info[9] = "Переживши нещастя, смерть друзів, брата і відсутність коханої дівчини в житті, Тор стикається з екзистенційною кризою. Від затяжних пошуків внутрішнього спокою він відволікається на звістку про нового галактичного лиходія Горру - останнього вцілілого представника свого виду, який знайшов потужний артефакт, що дозволяє вбивати богів. Щоб відбити загрозу, Тор заручається підтримкою королеви Нової Асгарда Валькірії, безстрашного гладіатора Корга і... його колишня дівчина, астрофізик Джейн Фостер, якій вдалося освоїти Мйольнір.";

        names[10] = "Доктор Стрендж: У мультивсесвіті божевілля";
        info[10] = "Доктор Стівен Стрендж відправляється на весільне торжество своєї колишньої колеги Крістен Палмер, попутно розмірковуючи про власне майбутнє. Змучена химерними мріями про загадкову фігуру, Стрендж вступає в контакт з Америкою Чавес, дівчиною-підлітком, що ховається від смертельної сили, яка хоче вкрасти здатність дівчини подорожувати по мультивсесвіту. Разом з Вонг і Вандою Максимофф Стрендж має намір захистити дівчину, а для цього супергерої повинні спочатку вистежити могутнього лиходія, який полює на неї.";

        names[11] = "Чорна пантера: Ваканда назавжди";
        info[11] = "У продовження історії про Ваканду королеві Рамонді, Шурі, М'Баку, Окоє і всій команді Дори Мілаче доведеться боротися, щоб захистити свій народ після смерті короля Т'Чали. Крім того, головним героям доведеться прокласти новий шлях, по якому буде розвиватися королівство Ваканда.";

        names[12] = "Смерть на Нілі";
        info[12] = "Дія фільму відбувається на борту пароплава «Карнак», що пливе по Нілу, де Пуаро змушений розслідувати смерть багатої спадкоємиці. Поступово детектив розуміє, що вбивство - не єдине правопорушення, яке вчиняється або безпосередньо на борту, або раніше скоєним людьми, що пливуть на «Карнаку». Серед пасажирів зустрічаються два злодія, шахрай, скажений комуніст і навіть міжнародний терорист.";


        ganr[0] = "Рік: 2021\n" +
            "Країна: США\n" +
            "Жанр: Фантастика";
        ganr[1] = "Рік: 2022\nКраїна: США\nЖанр: Екшен";
        ganr[2] = "Рік: 2022\nКраїна: США\nЖанр: Екшен";
        ganr[3] = "Рік: 2022\nКраїна: США\nЖанр: Фантастика";
        ganr[4] = "Рік: 2022\nКраїна: США\nЖанр: Пригоди";
        ganr[5] = "Рік: 2020\nКраїна: Великобританія\nЖанр: Пригоди";
        ganr[6] = "Рік: 2017\nКраїна: Великобританія\nЖанр: Детектив";
        ganr[7] = "Рік: 2022\nКраїна: США\nЖанр: Пригоди";
        ganr[8] = "Рік: 2022\nКраїна: Великобритания\nЖанр: Пригоди";
        ganr[9] = "Рік: 2022\nКраїна: Австралія\nЖанр: Фантастика";
        ganr[10] = "Рік: 2022\nКраїна: США\nЖанр: Фантастика";
        ganr[11] = "Рік: 2023\nКраїна: США\nЖанр: Фантастика";
        ganr[12] = "Рік: 2022\nКраїна: Великобританія\nЖанр: Детектив";

        for (int i = 0; i < names.Length; i++)
        {
            _names[i].text = names[i];
            _infos[i].text = ganr[i];
        }


    }


    public void On_Cliked(int i)
    {


        img.sprite = imgs[i];
        nameText.text = names[i];
        infoText.text = info[i];
        _ganr.text = ganr[i];
    }




}
